import React from 'react';
import './bootstrap.css';

const Home = () => {
    return (
        <div className="container fullwidth">
          <br /><br /><h1> What is MAD Camp? </h1><br />
          <p>2018년 여름학기 5주 동안 KAIST 전산학부에서 개설하는 CS496 스타트업과 집중 프로그래밍 캠프 교과목을 소개합니다.</p>

          <p>스타트업은 물론, 중견기업과 대기업 가릴 것없이 좋은 인재들이 부족하다고 합니다. 공대생들은 각박한 현실을 마주하기 위해 치열하게 공부하고 다방면에서 실력을 쌓기 위한 노력을 하는 사이 조금씩 지쳐가는 것 같은데, 왜 기업에서는 부족하다고 느낄까요? 소프트웨어 기술 중심의 창업이나 개발에 관심이 있는 학생들은 본 교과목을 통해서, 동료 학생들과 함께 자율적으로 개발 경험을 쌓으면서 스스로 그 실력이 일취월장하는 것을 직접 경험하는 기회를 가져볼 수 있습니다. 이런 집중 성장의 느낌은 참여자들의 삶에 커다란 긍정적 영향을 끼칩니다. 또한 여러 스타트업 창업자들이 창업과정에서 직접 몸으로 부딪히며 얻은 경험을 나누는 시간을 통해 스타트업의 매력을 알아볼 수 있으며, 자연스럽게 참여자들이 스스로의 삶에 대해서 한번쯤 돌아보는 기회를 제공합니다.</p>

          <p>2018년 6월 29일 금요일부터 2018년 8월 2일 목요일까지 아침부터 밤 늦게까지, 여러 스타트업 대표님들의 강연과 집중 개발을 경험하고 싶으신 분은 KAIST 전산학부에서 여름학기 5주 동안 개설하는 CS496 스타트업과 집중 프로그래밍 캠프 교과목을 신청해주세요. 본 교과목에서는 수강생을 위해 24x7 개방하는 전용 실습실, 다양한 실습 장비, 개인별 모니터 2대와 전용 PC를 제공합니다. 2017년 겨울학기에는 4개의 국내 타대학에서도 지원을 받았는데, 2018년 여름학기에는 10개의 국내 타대학과 해외대학 한인학생에게서도 지원을 받고, 20명씩 3개의 반으로 진행할 계획입니다. 아침부터 밤 늦게까지, 매우 밀도있는 집중 프로그래밍 캠프이므로, 이틀 이상 불참이 예상된다면 혹은 정기적으로 시간을 다른 곳에 활용해야 한다면, 수강 신청을 하지 않기를 바랍니다. 대전에 있는 KAIST 기숙사에서 5주 동안 지내야 하는 교과목입니다. 물론, 일요일에는 쉬는 것을 권합니다. 본교와 KAIST는 MOU가 체결되어 있어서, 계절학기 학점교류로 수강이 가능합니다. 학점인정에 대한 내용은 학과 사무실이나 강사진인 류석영 (sryu.cs@kaist.ac.kr)에게 문의해주시면 됩니다.</p>

          <p>모집 기간 : 2018년 4월 21일 ~ 2018 년 5월 9일</p>
          <p>모집 인원 : 60 명</p>
          <p>참가 대상 : 국내 및 해외 대학생</p>
          <p>신청 방법 : 구글 지원서 작성 : <a href="https://bit.ly/2EV5uVe" target="_blank1">https://bit.ly/2EV5uVe </a></p>
          <p>수업 내용 : <a href="https://bit.ly/2HE08AH" target="_blank2">https://bit.ly/2HE08AH </a></p>
          <p>선발 방법 : 서류 심사</p>
          <p>수강생발표 : 2018년 5월 17 일, 개인별 이메일 공지</p>
          <p>캠프 기간 : 2018년 6월 29일(금) ~ 2018년 8월 2일(목) (5주 간)</p>
          <p>장 소 : 대전 카이스트 실습실 및 강의실, 기숙사</p>
          <p>참가 비용 : 수강료 5만원, 기숙사비 45만원 내외</p>
          <p>지원 사항 : 24시간 전용 실습실, 실습 장비 및 개인별 모니터 2대와 전용 PC</p>

          <p>수강생은 어느 정도 ‘공통성’을 가져야 하지만 ‘다양성’을 고려해서 구성합니다. ‘공통성’은 태도, 의지, 열정, 협업 등이고, ‘다양성’은 개발 실력의 경우 조금 부족한 학생부터 일정 수준의 경험이 있는 학생까지 포함되기를 바랍니다. 물론, 자라온 배경이 가급적 다른 것도 바라는 다양성입니다. 따라서, 2학년부터 다양한 학년으로 구성되기를 기대하고, 선수 과목이 없습니다. 내년에도 같은 교과목을 개설할지는 확정하기 힘들지만, 학생들이 잘 하고 강의평가가 좋다면, 방학마다 꾸준히 개설하고자 합니다.</p>

          <p>많은 관심 부탁드립니다.</p>
          —
          <p>KAIST 전산학부 CS496 강사진 드림</p>

          <p align="center"><button type="button" className="btn btn-primary">신청</button></p>
        </div>
    );
};

export default Home;
